//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// clss Arm(h) - отвечает за количество патронов и их //
// регенерацию                                        //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
class Arm
{
private:
	int amt;		// нынешнее количество патронов
	int maxAmt;		// максимальное количество патронов

public:
	void regenAmt(bool);	// востановление патронов до
							// максимального количества 
	int getAmt();			//

	Arm();			// изначально устанавливает 10 патровон
	~Arm();
};

