//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// clss Arm(h) - отвечает за количество патронов и их //
// регенерацию                                        //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
#include "globals.h"

class Arm
{
private:
	int amt;		// нынешнее количество патронов
	int maxAmt;		// максимальное количество патронов

public:
	void regenAmt();		// востановление патронов до
							// максимального количества 
	void shoot();			// отнимает 1 снаряд

	int getAmt();			//

	Arm();			// изначально устанавливает 10 патровон
	~Arm();
};

