//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// class BlastArm : Aster(h) - стандартное оружие     //
// рокеты                                             //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
#include "Aster.h"

class BlastArm : public Aster
{
private:

public:

	BlastArm();		// устанавливает флаг arm
					// устанавливает face как |
	~BlastArm();
};
