//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// clss BoomMechanic(h) - отвечает за столкновения    //
// объектов в поле                                    //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
#include "Aster.h"

class BoomMechanic
{
private:

public:
	bool boomWithArm(Aster*);	//проверяет наличие объекта

	BoomMechanic();				//
	~BoomMechanic();
};

