//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// glabals constant                                   //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once

const int H = 30;		// высота поля (30)
const int L = 31;		// ширина поля (31)
const int FACE = 6;		// количество типов врагов
// очки для 5 типов врагов
const int SCR[FACE] = {100, 200, 350, 400, 500, 0};
const int ARM = 5;		// количество типов вооружения
const int DMG[ARM] = { 1, 2, 3, 4, 5 };	// урон для 5 орудий
const int AMU[ARM] = { 10, 5, 3, 5, 1 };	// макс. количество
											// патронов для 5 орудий
	
const int MAXHP = 10;	// макс. hp
