//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// class HP(h) - отвечает за жизнь объекта            //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
class HP
{
private:
	int hp;			// показатель hp

public:
	bool downHP(int);	// уменьшает hp
	void upHP(int);		// увеличивает hp
	void init(char);	// устанавливает количество hp
						// в зависимсоти от face объекта
	int getHP();		// 

	HP();		// hp == 1
	~HP();
};
