//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// clss Key(h) - управление ракетой в небольшой       //
//части поля                                          //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
#include<thread>
#include "Roc.h"

class Key
{
private:
	Roc* line[31];	//
	int standart;	//
	int posRoc;		//
	Roc roc;		//

public:
	int check();		//отслеживание нажатия клавишь
	void show();		//отоброжение на экран
	void fixStandart();	//отвечает за изменение стандартного 
						//набора клавишь управления

	Key();			//создаёт нижний ряд поля и устанавливает 
					//ракету в его центр (14)
	~Key();
};
