//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// clss Roc(h) - является предстовлением ракеты ГГ    //
// данной игры                                        //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
#include "MechanicShoot.h"
#include "Arm.h"
#include "HP.h"

class Roc
{
private:
	MechanicShoot sh;	// механизм стрельбы
	char face;			// иконка

public:
	HP hp;				// жизни
	Arm arm;			// механизм подсчёта снарядов

	char getFace();		// отоброжение на экране
	bool shoot();		// стрельба

	Roc();				//задаёт face
	~Roc();
};

