//****************************************************//
// dirty_firefly                                      //
//****************************************************//
// SpaceKiller                                        //
//                                                    //
// class Score(h) - отвечает за очки получаемые       //
// игроком после уничтожения врага                    //
//----------------------------------------------------//
// alpha                                              //
//****************************************************//

#pragma once
#include "globals.h"

class Score
{
private:
	int score;	// очки объекта

public:
	void init(char);	//устанавливает необходимое количество очков
						//в зависимости от объекта

	int getScore();		//

	Score();			//устанавливает score в 0
	~Score();
};

